submition/assignment2/assignment2_petri_net.dot
digraph assignment2_petri_net {
  rankdir=LR;
  graph [label="Assignment 2 Alpha-Mined Petri Net", labelloc=t, fontsize=18];
  node [fontname="Arial"];
  p_start [shape=circle, label="Start", width=0.75 penwidth=3];
  p_01 [shape=circle, label="p1", width=0.75];
  p_02 [shape=circle, label="p2", width=0.75];
  p_03 [shape=circle, label="p3", width=0.75];
  p_04 [shape=circle, label="p4", width=0.75];
  p_05 [shape=circle, label="p5", width=0.75];
  p_06 [shape=circle, label="p6", width=0.75];
  p_07 [shape=circle, label="p7", width=0.75];
  p_08 [shape=circle, label="p8", width=0.75];
  p_09 [shape=circle, label="p9", width=0.75];
  p_10 [shape=circle, label="p10", width=0.75];
  p_11 [shape=circle, label="p11", width=0.75];
  p_end [shape=doublecircle, label="End", width=0.75 penwidth=3];
  t_Check_stock [shape=box, style="rounded", label="Check stock"];
  t_Check_materials [shape=box, style="rounded", label="Check materials"];
  t_Retrieve_item [shape=box, style="rounded", label="Retrieve item"];
  t_Request_materials [shape=box, style="rounded", label="Request materials"];
  t_Obtain_materials [shape=box, style="rounded", label="Obtain materials"];
  t_Manufacture [shape=box, style="rounded", label="Manufacture"];
  t_Confirm_order [shape=box, style="rounded", label="Confirm order"];
  t_Emit_invoice [shape=box, style="rounded", label="Emit invoice"];
  t_Get_address [shape=box, style="rounded", label="Get address"];
  t_Receive_payment [shape=box, style="rounded", label="Receive payment"];
  t_Ship_product [shape=box, style="rounded", label="Ship product"];
  t_Archive_order [shape=box, style="rounded", label="Archive order"];
  p_start -> t_Check_stock;
  t_Check_materials -> p_01;
  p_01 -> t_Manufacture;
  p_01 -> t_Request_materials;
  t_Check_materials -> p_02;
  t_Obtain_materials -> p_02;
  p_02 -> t_Manufacture;
  t_Check_stock -> p_03;
  p_03 -> t_Check_materials;
  p_03 -> t_Retrieve_item;
  t_Confirm_order -> p_04;
  p_04 -> t_Emit_invoice;
  t_Confirm_order -> p_05;
  p_05 -> t_Get_address;
  t_Emit_invoice -> p_06;
  p_06 -> t_Receive_payment;
  t_Get_address -> p_07;
  p_07 -> t_Ship_product;
  t_Manufacture -> p_08;
  t_Retrieve_item -> p_08;
  p_08 -> t_Confirm_order;
  t_Receive_payment -> p_09;
  p_09 -> t_Archive_order;
  t_Request_materials -> p_10;
  p_10 -> t_Obtain_materials;
  t_Ship_product -> p_11;
  p_11 -> t_Archive_order;
  t_Archive_order -> p_end;
}
